// array หลายมิติ
#include <iostream>
using namespace std ;
int main() 
{
    int m[3][4] = {        //เหมือน matrix ข้างหน้าเป็นแถว ข้างหลังเป็นหลัก
        {1, 2, 3, 4},
        {5, 6, 7, 8},
        {9, 10, 11, 12}
    };
    for (int i = 0; i < 3; i++)
    {
        for (int j = 0; j < 4; j++)
        {
            cout << "m[" << i << "][" << j << "] = " <<  m[i][j] << endl ;
        }
    }
    return 0;
}

/* output ;
m[0][0] = 1     ---> แถวที่ 0 หลักที่ 0
m[0][1] = 2
m[0][2] = 3
m[0][3] = 4
m[1][0] = 5
m[1][1] = 6
m[1][2] = 7
m[1][3] = 8
m[2][0] = 9
m[2][1] = 10
m[2][2] = 11
m[2][3] = 12    ---> แถวที่ 2 หลักที่ 3
*/